Autodesk.Revit.DB.Architecture.ToposurfaceData.GetIdentifier
Gets the unique identifier of the Toposurface.
Since:
2019

Autodesk.Revit.DB.Architecture.ToposurfaceData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.ToposurfaceData.#ctor(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{System.Collections.Generic.IList{System.Int32}})
Creates a new ToposurfaceData class.
name:
The surface name.
points:
The surface points.
facets:
The surface facets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.ToposurfaceData
Represents a Toposurface's data.
Remarks:
The data of Toposurface includes name, points, facets, etc.
Since:
2019